#+TITLE: Writing Technical Documentation using Emacs

#+SETUPFILE: /Users/mengwangk/workspace/development/alpha2phi/mock-projects/tech_docs_with_emacs/setup.conf
#+PROPERTY: header-args :mkdirp yes :dir ~/workspace/development/alpha2phi/mock-projects/tech_docs_with_emacs/generated/
#+INCLUDE: code.inc
#+CALL: init()

* Python
** Testing

This is Python section
#+begin_src python :results output
  print("Writing technical docs using Emacs")
#+end_src

#+RESULTS:
: Writing technical docs using Emacs

* Shell
Shell script

#+begin_src shell
echo "testing"
#+end_src

#+RESULTS:
: testing
